{
  "data": [
    {
      "title": "doa keluar rumah",
      "subtitle": "",
      "arab": "بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
      "transliterasi": "Bismillahi, tawakkaltu ’alallah, laa haula wa laa quwwata illaa billaah",
      "translasi": "Artinya: “Dengan menyebut nama Allah, aku menyerahkan diriku pada Allah dan tidak ada daya dan kekuatan selain dengan Allah saja”. (HR. Abu Daud dan Tirmidzi)"
    },
    {
      "title": "doa setelah duduk di kendaraan",
      "subtitle": "",
      "arab": "سُبْحَانَ الَّذِى سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِى سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى وَمِنَ الْعَمَلِ مَا تَرْضَى اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِى السَّفَرِ وَالْخَلِيفَةُ فِى الأَهْلِ اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِى الْمَالِ وَالأَهْلِ",
      "transliterasi": "Subhaanalladzii sakhhorolana hadzaa wamaa kunnaa lahu muqriniina wa innaa ilaa rabbina lamunqolibuuna. Allahumma innaa nasaluka fii safarina hadzal birro wattaqwaa waminal 'amali maa tardho. Allahumma hawwin 'alaina safarana hadzaa wathwi'anna bu'dahu. Allahumma antash shoohibu fissafari wal khalifatu filahli. Allahumma innii a'uudzubika min wa'tsaaissafari wakaabatilmandhori wasuuuilmunqolabi filmaali wal ahli.",
      "translasi": "Mahasuci Allah yang telah menundukkan untuk kami kendaraan ini, padahal kami sebelumnya tidak mempunyai kemampuan untuk melakukannya. Sesungguhnya hanya kepada Rabb kami, kami akan kembali. Ya Allah, sesungguhnya kami memohon kepada-Mu kebaikan, takwa dan amal yang Engkau ridhai dalam perjalanan kami ini. Ya Allah mudahkanlah perjalanan kami ini, dekatkanlah bagi kami jarak yang jauh. Ya Allah, Engkau adalah rekan dalam perjalanan dan pengganti di tengah keluarga. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kesukaran perjalanan, tempat kembali yang menyedihkan, dan pemandangan yang buruk pada harta dan keluarga.\" (HR Muslim).\n\nSaat sudah duduk di kendaraan, Muslim disunahkan membaca takbir tiga kali, hamdalah (3 kali) dan tahlil (sekali). Setelah itu, membaca doa naik kendaraan."
    },
    {
      "title": "doa ketika kendaraan mulai bergerak",
      "subtitle": "",
      "arab": "بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمْ . اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ. سُبْحَانَ الَّذِي سَخَّرَلَنَا هَذَا وَ مَا كُنَّا لَهٗ مُقْرِنِيْن . وَ اِنَّا اِلَى رَبِّنَا لَُمنْقَلِبُوْن\nاَللّهُمَّ اِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا لْبِرَّ وَالتَّقْوٰى وَمِنَ الْعَمَلِ مَا تَرْضٰى. اَللّٰهُمَّ انْتَ الصَّحِبُ فِي السَّفَرِ وَ الْخَلِفَةُ فِى اْلأَهْلِ. اَللّٰهُمَّ أِنِّيْ أَعُوْذُبِكَ مِنْ وَّ عْثَاءِ السَّفَرِ وَ كَبَّةِ أْلمَنْظَرِ وَ سُوءِ اْلمُنْقَلَبِ فِى اْلمَالِ وَاْلاَهْلِ وَالْوَلَد\n.بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ لَا حَوْلَ وَلَا قُوَّةَ اِلَّا بِالله",
      "transliterasi": "Bimillahir-rahmanir-rahim. Allahu akbar, Allahu akbar, Allahu akbar. Subhanal-lazi sakhkhara lana haza wa ma kunna lahu muqrinin. Wa inna ila rabbina lamunqalibun. Allahmumma inna nas’aluka fi safarina hazal-birra wat-taqwa wa minal-’amali ma tarda. Allahumma hawwin ’alaina safarana haza wa atwi ’anna bu’dah. Allahuma antas-sahibu fis-safari wal-khalifatu fil-ahli. Allahumma inni a’uzu bika min wa’sa’is-safari wa ka’abatil-manzari wa su’il munqalabi fil-mali wal-ahli wal-walad.",
      "translasi": "Dengan menyebut nama Allah yang Maha Pemurah lagi Maha Penyayang. Allah Maha Besar. Allah Maha Besar. Allah Maha Besar. Maha Suci Allah yang telah menggerakkan untuk kami kendaraan ini padahal kami tiada kuasa menggerakkannya. Dan Sesuangguhnya kepada Tuhan, kami pasti akan kembali. Ya Allah kami memohon kepada-Mu dalam perjalanan kami ini kebaikan dan taqwa serta amal perbuatan yang Kau ridhai. Ya Allah, mudahkanlah perjalanan kami ini dan dekatkan jauhnya. Ya Allah, Engkau adalah yang menyertai dalam bepergian dan pelindung terhadap keluarga yang ditinggalkan. Ya Allah kami berlindung kepada-Mu dari kesukaran dalam bepergian, penampilan yang buruk, kepulangan yang menyusahkan dalam hubungan dengan harta benda, krluarga, dan anak."
    },
    {
      "title": "doa ketika sampai di tujuan",
      "subtitle": "",
      "arab": "اَلْحَمْدُ ِللهِ الَّذِى سَلَمَنِى وَالَّذِى اَوَنِى وَالَّذِى جَمَعَ الشَّمْلَ بِ",
      "transliterasi": "Allahumma hawwin 'alainaa safaranaa hadzaa waatwi 'annaa bu'dahu. Alloohumma Alhamdulillahil ladzi sallamani wal ladzi awani wal ladzi jama’asy syamla bi.",
      "translasi": "Segala puji bagi Allah, yang telah menyelamatkan akau dan yang telah melindungiku dan yang mengumpulkanku dengan keluargaku"
    },
    {
      "title": "Niat Haji",
      "subtitle": "",
      "arab": "نَوَيْتُ الْحَجَّ وَأَحْرَمْتُ بِهِ لِلهِ تَعَالَى لَبَّيْكَ اللَّهُمَّ بحَجًَةِ",
      "transliterasi": "nawaitul hajja wa ahramtu bihi lillahi ta’ala labbaika Allahumma hajjan.",
      "translasi": "Aku niat melaksanakan haji dan berihram karena Allah Swt. Aku sambut panggilan-Mu, ya Allah untuk berhaji"
    },
    {
      "title": "Niat Umrah",
      "subtitle": "",
      "arab": "نَوَيْتُ العُمْرَةَ وَأَحْرَمْتُ بِهَا لِلهِ تَعَالَى لَبَّيْكَ اللَّهُمَّ بعُمْرَة",
      "transliterasi": "nawaitul ‘umrata wa ahramtu bihi lillahi ta’ala labbaika Allahumma ‘umratan.",
      "translasi": "Aku niat melaksanakan umrah dan berihram karena Allah Swt. Aku sambut panggilan-Mu, ya Allah untuk berumrah"
    },
    {
      "title": "Niat Haji Sekaligus Umrah (Haji Qiran)",
      "subtitle": "",
      "arab": "نَوَيْتُ الْحَجَّ والعُمْرَةَ وَأَحْرَمْتُ بِهاَ لِلهِ تَعَالَى",
      "transliterasi": "nawaitul hajja wal ‘umrata wa ahramtu bihi lillahi ta’ala",
      "translasi": "Aku niat melaksanakan haji sekaligus umrah dan berihram karena Allah Swt"
    },
    {
      "title": "doa selesai berihram",
      "subtitle": "",
      "arab": "َاَللّٰهُمَّ أُحَرِّمُ شَعْرِيْ وَبَشَرِيْ وَجَسَدِيْ وَجَمِيْعَ جَوَارِحِيْ مِنَ الطِّبِّ و النِّسَآءِ وَكُلِّ شَيْءٍ حَرَّمْتَهُ عَلَى اْلمُحْرِمِ أَبْتَغِيْ بِذٰلِكَ وَجْهَكَ اْلكَرِيْمَ يَا رَبَّ الْعَالَِميْنَ.",
      "transliterasi": "Allahumma uharrimu sya'ri wa basyari wa jasadi wa jami'a jawarihi min kulli sya'in harfamtahu 'alal-muhrimi abtagi bizalika wajhakal-karima ya rabbal-'alamin.",
      "translasi": "Ya Allah aku haramkan rambut, kulit, tubuh dan seluruh anggota tubuhku dari semua yang Kau haramkan bagi seorang yangs edang berihram, demi mengharapkan diri_mu semata, wahai Tuhan pemelihara alam semesta."
    },
    {
      "title": "doa talbiyah",
      "subtitle": "",
      "arab": "لَبَيْكَ اللَّهُمَّ لَبَيْكَ. لَبَيْكَ لَا شَرِيْكَ لَكَ لَبَيْكَ. إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيْكَ لَكَ",
      "transliterasi": "Labbaik Allahumma labbaik. Labbaik laa syarika laka labbaik. Innal hamda wan ni’mata laka wal mulka laa syarika lak",
      "translasi": "Aku datang memenuhi panggilan-Mu ya Allah, Aku datang memenuhi panggilan-Mu, Aku datang memenuhi panggilan-Mu, tidak ada sekutu bagi-Mu. Seseungguhnya segala puji, nikmat dan segenap kekuasaan hanya milik-Mu, tidak ada sekutu bagi-Mu"
    },
    {
      "title": "doa memasuki kota makkah",
      "subtitle": "",
      "arab": "اَللّٰهُمَّ هٰذَا حَرَمُكَ وَأَمْنُكَ فَحَرِّمْ لَحْمِيْ وَدَمِيْ وَشَعْرِيْ وَبَشَرِيْ عَلَى النَّارِ وَاٰمِنِّيْ مِنْ عَذَابِكَ يَوْمَ تَبْعَثُ عِبَادَكَ وَاجْعَلْنِيْ مِنْ أَوْلِيَآئِكَ وَأَهْلِ طَاعَتِكَ.",
      "transliterasi": "Allahumma haadza haramuka wa amnuka faharrimlahmi wadamii wabasyarii ‘alannar, wa aminnii min ‘adzabika yauma tab’atsu ‘ibaadaka waj’alnii min auliyaa ika wa ahli thoo’atik.",
      "translasi": "Ya Allah kota ini adalah tanah Haram-Mu dan tempat yang aman, maka hindarkanlah daging, darah, rambut, bulu dan kulitku dari neraka. Amankanlah aku dari siksa-Mu pada hari Engkau membangkitkan aku ke dalam golongan aulia-Mu dan ahli ta’at pada-Mu."
    },
    {
      "title": "doa masuk masjidil haram",
      "subtitle": "",
      "arab": "اَللّٰهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ فَحَيِّنَا رَبَّنَا بِالسَّلَامِ وَأَدْخِلْنَا الْجَنَّةَ دَارَالسَّلَامَ تَبَارَكْتَ وَتَعَالَيْتَ يَا ذَاالْجَلَالِ وَاْلإِكْرَامِ. اَللّٰهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ وَمَغْفِرَتِكَ وَأَدْخِلْنِيْ فِيْهَا. بِسْمِ اللهِ وَالْحَمْدُ ِللهِ وَالصَّلَاةُ وَالسَّلَامُ عَلٰى رَسُوْلِ اللهِ",
      "transliterasi": "Allahumma antassalaam, waminkassalaam fahayyinaa rabbanaa bissalaam wa adkhilnal jannata daarassalaam tabaarakta wata’aalaita yaa dzaljalaali wal ikraam. Allahummaftah lii abwaaba rahmatika wamaghfiratika wa adkhilnii fiihaa. Bismillahi walhamdulillahi wasshalaatu wassalaamu ‘alaa rasuulillaah.",
      "translasi": "Ya Allah Engkau sumber keselamatan, dan dariMu lah datangnya keselamatan itu semua. Maka sambutlah kami wahai Tuhan dengan selamat sejahtera dan masukanlah kami ke dalam surga negeriMu yang bahagia, Maha Pemberi berkat dan Maha Tinggilah Engkau wahai Tuhan yang punya keagungan dan kehormatan. Ya Allah bukakanlah untukku pintu rahmat dan ampunan, masukanlah aku ke dalam ampunanMu. Dengan nama Allah dan segala puji bagi Allah salawat dan salam untuk Rasulullah"
    },
    {
      "title": "doa ketika melihat ka'bah",
      "subtitle": "",
      "arab": "لَا إِلَهَ إِلَّا اللهَ واللُه أَكْبَرُ اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلَامُ وَدَارُكَ دَارُ السَّلَامِ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالإِكْرَامِ الَّلهُمَّ إِنَّ هَذَا بَيْتُكَ عَظَّمْتَهُ وَكَرَّمْتَهُ وَشَرَّفْتَهُ اللَّهُمَ فَزِدْهُ تَعْظِيمًا وَزِدْهُ تَشْرِيفًا وَتَكْرِيمًا وَزِدْهُ مَهَابَةً وَزِدْ مَنْ حَجَّهُ بِرًّا وَكَرَامَةً اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَأَدْخِلْنِي جَنَّتَكَ وَأَعِذْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "transliterasi": "Laa ilaha illallaha, allahu akbar, allahuma antas salam wa minkas salam wa darukas salam, tabaarakta ya dzal jalali wal ikram, allahuma inna hadza baituka ‘adzdzamtahu wa karamtahu wa syarriftahuK allahuma fazidhu ta’dziman wa zidhu tasyrifan wa takriman wa zidhu mahabatan wa zid man hajjahu birran wa karamatan, allahumaftah li abwaba rahmatik wa adkhilni jannataka wa a’idzni minasy syaithanirrajim",
      "translasi": "Tidak ada Tuhan selain Allah, Allah Maha Besar. Ya Allah, Engkalah keselamatan, dari-Mu keselamatan dan rumah-Mu adalah rumah penuh keselamatan. Maha Suci Engkau, Wahai Dzat Pemilik Keagungan dan kemuliaan. Ya Allah sesungguhnya ini adlah rumah-Mu yang telah Engkau anugerahi keagungan, kemuliaan dan kehormatan. Ya Allah maka dari itu tambahkanlah keagungannya, tambahkan kemulian dan kehomatannya, tambahkan wibawanya dan tambahkan kebaikan dan kehormatan bagi orang yang pergi menuju ke sana. Ya Allah. bukakanlah untukku pintu-pintu rahmat-Mu dan masukkanlah aku ke dalam surga-Mu serta lindungilah aku dari godaan setan yang terkutuk."
    },
    {
      "title": "doa tawaf antara rukun yamani dan hajar aswad",
      "subtitle": "Diantara Rukun Yamani dan Hajar Aswad membaca:",
      "arab": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي اْلآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "transliterasi": "Rabbanaa aatina fid-dun-yaa hasanatan wa filaakhirati\nhasanatan wa qina ‘adzaaban-naar.",
      "translasi": "Wahai Tuhan kami, berilah kami kebaikan di dunia, kebaikan di akhirat dan lindungilah kami dari adzab neraka."
    },
    {
      "title": "doa tawaf putaran pertama",
      "subtitle": "Doa dan Bacaan Thawaf Putaran Pertama : dibaca mulai dari Hajar Aswad sampai Rukun Yamani.",
      "arab": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللهَ اللهُ أَكْبَرُ. وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيْمِ. وَالصَّلَاةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ إِيْمَانًا بِكَ وَتَصَدِّيْقًا بِكِتَابِكَ وَوَفَاءاً بِعهدك وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ إِنِّي أَسْئَلُكَ الْعَفْوَى وَالْعَافِيَةَ الدَّائِمَةَ فِي الدِّيْنِ وَالدُّنْيَا وَالْأَخِرَةَ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةِ مِنَ النَّارِ",
      "transliterasi": "Subahaanallaahi walhamdulillaahi wa laa ilaaha illallaahu allahu akbar. wa laa haula wa laa quwwata illaa billaahil ‘aliyyil ‘azhiimi. Wash shalaatu wassalaamu’alaa rasuulillaaahi shallallaahu ‘alaihi wa sallama. Allahumma iimaanan bika wa tashdiqan bikitaabika wa wafaa’an bi’aadhika wattibaa’an li sunnati nabiyyika muhammadin shallaahu ‘alaihi wa sallama. Allahumma inni as’alukal ‘afwa wal ‘aafiya wal mu’aafatan daaimata fid diini wad dunyaa wal aakhirati wal fauza bil jannati wannajaata minannaari.",
      "translasi": "Maha suci Allah, segala bentuk pujian hanya pantas disanjungkan kepada-Nya, sebab tiada Tuhan selain Allah, Dzat Yang Maha Besar. Tidak ada daya dan kekuatan kecuali berasal dari sisi-Nya yang Maha Mulia lagi Maha Agung. Shalawat serta salam semoga senantiasa tertuju kepada Rasulullah, sebagaimana Allah selalu mencurahkan shalawat dan salam kepada beliau. Ya Allah, aku melakukan tawaf ini hanya karena beriman kepada-Mu, membenarkan kitab-Mu, dan memenuhi janjiku pada-Mu, serta mengikuti sunnah Nabi-Mu Muhammad Saw. Ya Allah, sesungguhnya aku memohon ampunan kepada-Mu, kesehatan, danperlindungan yang kekal dalam menjalankan aturan agama, baik urusan dunia maupun akhiratku, juga untuk beroleh kenikmatan surga dan terhindar dari azab neraka.",
      "next": []
    },
    {
      "title": "doa tawaf putaran kedua",
      "subtitle": "Doa dan Bacaan Thawaf Putaran Kedua : dibaca mulai dari Hajar Aswad sampai Rukun Yamani.",
      "arab": "اللَّهُمَّ إِنََ هَذَا الْبَيْتَ بَيْتُكَ وَالْحَرَاَم حَرَامُكَ وَالْأَمْنَ أَمْنُكَ وَالْعَبْدَ عَبْدُكَ وَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ وَهَذَا مَقَامُ عَيْذُكَ بِكَ مِنْ النَّارِ فَحَرِّمْ لُحُومُنَا وَبَشِّرْنَا عَلَى النَّارِ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْإيْمَانَ وَزَيِّنْهُ فِي قَلُوبِنَا وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ وَاجْعَلْنَا مِنَ الرَّاشِدِينَ اللَّهُمَّ قِنِي عَذَابَكَ الْيَوْمَ تَبْعَثُ عِبَادَكَ اللُّهُمَّ ارْزُقْنَا الْجَنَّةَ بِغَيْرِ حِسَابٍ",
      "transliterasi": "Allahumma innaa haadzal baita baituka wal haraama haraamuka wal amna amnuka wal ‘abda ‘abduka wa anaa ‘abduka wabnu ‘abdika wa haadzaa maqaamu ‘aidza bika minannaari faharrim luhuumanaa wa basyaranaa ‘alannaari. Allahumma habbib ilainal iimaana wa zayyinhu fii quluubinaa wa karrih ilainal kufra wal fusuuqa wal ‘ishyaanaa waj’alnaa minar raasyidiina. ALlahumma qinii ‘adzaabaka yauma tab’atsu ‘ibaadaka. Allahummarzuqnal jannata bighairi hisaabin.",
      "translasi": "Ya Allah, sesungguh ya Ka’bah ini adalah rumah-Mu, tanah yang mulia di sekitarnya adalah tanah-Mu, negeri yang aman ini adalah negeri-Mu, hamba ini adalah hamba-Mu, anak dari hamba-Mu, dan tempat ini adalah tempat para hamba berlindung kepada-Mu dari siksa api neraka. Haramkanlah daging dan kulit kami dari jilatan api neraka. Ya Allah, cintakanlah kami kepada iman dan biarkanlah keimanan itu menghiasi hati kami. Tanamkanlah kebencian terhadap perbuatan kufur, fasik, dan durhaka kepada-Mu, dan masukkanlah kami ke dalam golongan hamba-Mu yang mendapat petunjuk. Ya Allah, lindungilah aku dari azab-Mu pada hari Engkau kelak membangkitkan hamba-hamba-Mu. Ya Allah, anugerahkanlah surga kepadaku tanpa melalui perhitungan."
    },
    {
      "title": "doa tawaf putaran ketiga",
      "subtitle": "Doa dan Bacaan Thawaf Putaran Ketiga : dibaca mulai dari Hajar Aswad sampai Rukun Yamani.",
      "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِن الشَّكِّ وَالشِرْكِ والشِّقَاقِ والنِّفَاقِ وسُوءِ الأَخْلاَقِ وَسُوءِ المَنْظَرِ وَالمُنْقَلِبِ فِي المَالِ والأَهْلِ والوَلَدِ اللَّهُمَّ إِنِّي أَسْألُكَ رِضَاكَ والجَنَّةَ وأَعُوذُبِكَ مِن سَخَطِكَ والنَّارِ وَاالهَمِّ إِنِّي أَعُوذُبِكَ مِنْ فِتْنَةِ القُبُرِ وأَعُوذُ بِكَ مِن فِتْنَةِ المَحْيَا والمَمَاتِ",
      "transliterasi": "Allahumma inni a’udzubika minasysyakki wasysyirki wasysyiqaaqi wannifaaqi wa suu’il akhlaaqi wa suu’il manzhari wal munqalabi fil maali wal ahli wal waladi. Allahumma innii as’aluka ridhaaka wal jannata wa a’udzubika min shkathika wannaar. Allahumma innii a’udzubika min fitnatil qabri wa a’udzubika min fitnatil mahyaa wal mamaati.",
      "translasi": "Ya Allah, aku berlindung kepada-Mu dari keraguan syirik, bantah-bantahan, kemunafikan, akhlak yang buruk, dan penampilan serta kondisi kembali yang buruk, dalam hubungannya dengan harta benda, keluarga, dan anak-anak. Ya Allah, sesungguhnya aku memohon kepada-Mu keridhaan-Mu dan surga. Aku juga berlindung kepada-Mu dari murka-Mu dan siksa api neraka. Ya Allah, aku berlidung kepada-Mu dari fitnah kehidupan dan derita kematian."
    },
    {
      "title": "doa tawaf putaran keempat",
      "subtitle": "Doa dan Bacaan Thawaf Putaran Keempat : dibaca mulai dari Hajar Aswad sampai Rukun Yamani.",
      "arab": "اللَّهُمَّ اجْعَلْنِي حَجًّا مَبْرُورًا وَسَعْياً مَشْكُورًا وَذُنُباً مَغْفُورًا وَعَمَلًا صَالِحًا مَقْبُولًا وَتِجًارَةً لًنْ تَبُورًا. يَا عَالِمً مَا فِي الصُّدُورِِ أَخْرِجْنِي مِن الظُّلُمَاتِ إِلَى النُورِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِن كُلِّ إِثْمٍ والغَنِيمَةَ مِن كُلِّ بِرٍّ والفَوْزَ بِالجَنَّةِ مِن النَّارِ رَبِّي قَنِّعْنِي بِمَا رَزَفَنِي وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي وَاخْلُفْ عَلَيْنَا كُلَّ غَيْبَةٍ مِنْكَ بِخَيْرٍ",
      "transliterasi": "Allahummaj’alnii hajjan mabruuran wa sa’yan masykuuran wa dzanban maghfuura wa ‘amalan shaalihan maqbuulan wa tijaaratan lan tabuura. Ya ‘aalima maa fish shuduuri akhrijnii minazh zhulumaati ilannuri. ALlahumma inni as ‘aluka mujibaati rahmatika wa ‘azaa’imi maghfiratika wassalaaamata min kulli itsmin wal ghaniimata min kulli birrin wal fauza bil jannati wannajaata minannaari. Rabbi qanni’nii bimaa razaqtanii wa baariklii fiimaa ‘athaitanii wakhluf ‘alaynaa kulla ghaibatin minka bikhairin.",
      "translasi": "Ya Allah, karunikanlah kepada kami haji yang mabrur, sa’i yang diterima, dosa yang diampuni, amal saleh yang diterima, dan usaha yang tidak mengalami kerugian. Wahai Tuhan Yang Maha Mengetahui segala yang terkandung dalam sanubari, keluarkanlah aku dari kegelapan menuju cahaya yang terang bendenrang. Ya Allah, aku memohon kepada-Mu segala urusan yang mendatangkan kasih sayang-Mu dan keteguhan ampunan-Mu, selamat dari segala desa dan beruntung karena memperoleh surga dan terhindar dari siksa api neraka. Ya Tuhanku, puaskanlah aku dengan anugerah yang telah Engkau berikan dan berkatilah untukku semua yang Engkau anugerahkan anugerahkan kepadaku dan gantilah segala yang terlepas dari pandanganku dengan kebaikan yang berasal dari sisi-Mu."
    },
    {
      "title": "doa tawaf putaran kelima",
      "subtitle": "Doa dan Bacaan Thawaf Putaran Kelima : dibaca mulai dari Hajar Aswad sampai Rukun Yamani.",
      "arab": "أللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لاَ ظِلَّ إِلَّا ظِلَّكَ وَلَا بَقِيَ إِلَّا وَجْهَكَ وَأَسْفِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْكَ وسَلَّم شُرْبَةً هَنِيئَةً مَرِيئَةً لَا أَظَؤُ بَعْدَهَا أَبَدًا. أللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرٍ مَا سَأَلَكَ مِنهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَعُوُذُبِكَ مِنْ شَرِّ مَا عَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ وَنَعِيمَهَا وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ وَأَعُوذُبِكَ مِنَ النَّارِ وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَْو فِعْلٍ أَوْ عَمَلٍ",
      "transliterasi": "Allahumma adzhillanii tahta zhilli ‘arsyika yauma laa zhilla illaa zhilluka walaa baqiya illaa wajhuka wa asqini min haudhi nabiyyika muhammadin shallallaahu ‘alaihi wasallama syurbatan haniii’atan marii’atan laa azah’u ba’dahaa abadan. Allahumma innii as’aluka min khairi maa sa’alaka minhu nabiyyiuka muhammadun shallallaahu ‘alaihi wa sallama wa a’uudzubika min syarri maa ‘aadzaka minhu nabiyyuka muhammadun shallallahu ‘alaihi wa sallama. Allahumma innii as’alukal jannata wa na’iimahaa wa maa yuqarribunii ilaihaa min qaulin au fi’lin au ‘amalim wa a’udzubika minannaari wa maa yuqaarribunii ilaihaa min qaulin au fi’lin au ‘amalin.",
      "translasi": "Ya ALlah, lindungilah aku di bawah naungan singgasana-Mu pada hari ketika tak ada naungan selain naungan-Mu dan tidak ada yang kekal kecuali Dzat-Mu. Berikanlah aku minuman dari telaga Nabi-Mu, Muhammad Saw dengan minuman yang lezat, segar, dan nyaman, yang sesudah itu aku tidak akan merasa kehausan selamanya. Ya Allah, aku memohon kepada-Mu kebaikan yang domohonkan oleh Nabi-Mu, Muhammad Saw dan keburukan yang dimintakan perlindungan kepada-Mu. Ya Allah, aku memohon kepada-Mu surga serta kenikmatannya dan apa saja yang dapat mendekatkan aku kepadanya, baik ucapan maupun perbuatan, dan aku juga berlindung kepada-Mu dari api neraka serta apa saya yang mendekatkan aku kepadanya baik ucapan maupun perbuatan."
    },
    {
      "title": "doa tawaf putaran keenam",
      "subtitle": "Doa dan Bacaan Thawaf Putaran Keenam : dibaca mulai dari Hajar Aswad sampai Rukun Yamani.",
      "arab": "اللَّهُمَّ إِنَّا لَكَ عَلَيَّ حُقُوقًا كَثِيرًا فِيمَا بَيْنِي وَبَيْنَكَ وَحُقُوقًا كثيرا فِيمَا بَيْنِي وَبَيْنَ خَلْقِكَ الَّلهُمَّ مَا كَانَ لَكَ مِنْهَا فَاغْفِرْهُ لِي وَمَا كَانَ لِخَلْقِكَ وَتَحَمَّلَهُ عَنِّي وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَبِطَاعَتِكَ عنْ مَعْصِيَتِكَ وَبِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ المَغْفِرَةِ اللََّهُمَّ إِنَّ بَيْتَكَ عَظِيمٌ وَوَجْهَكَ كَرِيْمٌ وَأَنْتَ يَا اللَّهُمََّ حَلِيمٌ كَرِيمٌ عَظِيمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنَّا",
      "transliterasi": "Allahuma innaa laka ‘alayya huquuqan katsiratan fiima bainii wa bainaka wa huquuqan katsiran fiiimaa bainii wa baina khalqika. Allahumma maa kaana laka minhaa faghfirhu lii wa maa kaana likhalqika fatahammalhu ‘annii wa aghninii bihalaalila ‘an haraamika wa bithaa’atika ‘an ma’shiyyatika wa bidadhlika ‘amman siwaaka yaa waasi’al maghfirati. Allahumma inna baitaka ‘azhiimun wa wajhaka kariimun wa anta yaa allahumma haliimun kariimun ‘azhiimun tuhibbul ‘afwa fa’fu’annii.",
      "translasi": "Ya Allah, sesungguhnya Eanhkau mempunyai banyak sekali hak dalam hubunganku dengan-Mu dan dengan makhluk-Mu. Ya Allah, apa yang menjadi hak-Mu kepadaku maka ampunilah diriku jika melalikannya. dan apa saja yang menjadi hak-Mu kepada makhluk-Mu maka tangguhkanlah dariku. Cukupkanlah aki dengan rezeki darisisi-Mu yang halal, terhindar dari kemaksiatan, dan dengan anugerah-Mu aku terhindar dari harapan terhadap selain Engkau, wahai Zat yang Maha Pengampun. Ya ALlah, sesungguhnya rumah-Mu (Ka’bah) ini sangat agung, Zat-Mu pun Maha Mulia, Engkau penyabar, Maha Pemurah, dan Maha Agung, serta sangat suka memberi ampunan, maafkan dan ampunilah aku."
    },
    {
      "title": "doa tawaf putaran ketujuh",
      "subtitle": "Doa dan Bacaan Thawaf Putaran Ketujuh : dibaca mulai dari Hajar Aswad sampai Rukun Yamani.",
      "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيْمَاناً كَامِلًا وَيَقِينًا صَادِقًا وَرِزْقًا وَاسِعًا وَقَلْبًا خَاشِعًا ولِسَانًا ذَاكِرًا وَحَلَالًا طَيِّبًا وَتَوْبَةً نَصُوحًا وَتَوْبَةً قَبْلَ المَوْتِ وَرَاحَةً عِنْدَ المَوْتِ وَمَغْفِرَةً وَرَحْمَةً بَعْدَ الَموْتِ وَالْعَفْوَ عِنْدَ الحِساَبِ واَلفَوْزَ بِالْجَنَّةِ وَالنَّجَاةِ مِنَ النَّارِ بِرَحْمَتِكَ يَا عَزِيْزُ بِاْلصَالِحِينَ",
      "transliterasi": "Allhumma innii as’aluka iimaanan kaamilan wa yaqiinan shaadiqan wa rizqan waasi’an wa qalban khaasyi’an wa lisaaanan dzaakiran wa halaalan thayyiban wa taubatan nashuuhan wa taubatan qablal mauti wa maghfiratan wa rahmatan ba’dal mauti wal ‘afwa ‘indal hisaabi wal fauza bil jannati wannajaata minannaari birahmatika yaa ‘aziizu bish-shaalihin",
      "translasi": "Ya Allah, aku memohon kepada-Mu iman yang sempurna, keyakinan yang benar, rezeki yang luas, hati yang khusuk, lisan yang selalu berzikir mengagungkan nama-Mu, rezeki yang halal dan baik, taubat yang diterima, taubat sebelum mati, ampunan pada saat diadakan perhitungan amal, keberuntungan memperoleh surga, rahmat dan kasih sayang-Mu, wahai Tuhan yang Maha Perkasa lagi Maha Pengampun. Ya Allah, berilah aku tambahan ilmu pengetahuan dan gabungkanlah aku ke dalam hamba-hamba-Mu yang saleh."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Do’a ketika hendak mendaki bukit Safa sebelum mulai sa’i",
      "arab": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ أَبْدَأُ بِماَبَدَأَ اللهُ بِهِ وَرَسُوْلُهُ إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Bismillaahirrahmaanirrahiim, Abda’u bimaa bada Allaahu bihi warasuuluh. Innas safa walmarwata min sya’airillah Faman hajjal baita awi’tamara fala junaha ‘alaihi ayyatawwafa bihima waman tatawwa’a khairan fa innallaha syakirun ‘alimBismillaahirrahmaanirrahiim, Abda’u bimaa bada Allaahu bihi warasuuluh. Innas safa walmarwata min sya’airillah Faman hajjal baita awi’tamara fala junaha ‘alaihi ayyatawwafa bihima waman tatawwa’a khairan fa innallaha syakirun ‘alim",
      "translasi": "Dengan nama ALLah yang Maha Pengasih dan Penyayang. Aku mulai dengan apa yang telah dimulai oleh Allah dan RasulNya. Sesungguhnya Safa dan Marwah sebagian dari Syi’ar-Syi’ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah Haji ke baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa’i antara keduanya. Dan barang siapa yang mengerjakan suatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha Penerima Kebaikan lagi maha Mengetahui.Dengan nama ALLah yang Maha Pengasih dan Penyayang. Aku mulai dengan apa yang telah dimulai oleh Allah dan RasulNya. Sesungguhnya Safa dan Marwah sebagian dari Syi’ar-Syi’ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah Haji ke baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa’i antara keduanya. Dan barang siapa yang mengerjakan suatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha Penerima Kebaikan lagi maha Mengetahui.",
      "next": []
    },
    {
      "title": "doa sa'i",
      "subtitle": "Do’a diatas bukit Safa ketika melihat Ka’bah",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ وَللهِ الحَمْدُ , أَللهُ أَكْبَرُ عَلَى ماَ هَداَناَ وَالحَمْدُ ِللهِ عَلَى ماَ أَوْلاَناَ . لاَإِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَشَرِيْكَ لَهُ , لَهُ المُلْكُ وَلَهُ الحَمْدُ يُحْيِى وَيُمِيْتُ بِيَدِهِ الخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ . لاَإِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزاَبَ وَحْدَهُ لاَ إِلَهَ إِلاَّ اللهُ وَلاَ نَعْبُدُ إِلاَّ إِياَهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الكاَفِرُوْنَ",
      "transliterasi": "Allahu Akbar, Allahu Akbar, Allahu Akbar walillahil hamdu. Allahu Akbar ‘alama hadana walhamdulillahi ‘alama aulana la ilaha illalahu wahdahu la syarika lahu, lahul mulku walahul hamdu yuhyi wayumitu biyadihil khairu wahuwa ‘ala kulli syai inqadir. La ilaha illallahu wahdahu lasyarika lah, anjaza wa’dahu wanasara ‘abdahu wahazamal ahzaba wahdah, la ilaha illallahu wala na’ buduilla iyyahu mukhilisina lahuddina walau karihal kafirunAllahu Akbar, Allahu Akbar, Allahu Akbar walillahil hamdu. Allahu Akbar ‘alama hadana walhamdulillahi ‘alama aulana la ilaha illalahu wahdahu la syarika lahu, lahul mulku walahul hamdu yuhyi wayumitu biyadihil khairu wahuwa ‘ala kulli syai inqadir. La ilaha illallahu wahdahu lasyarika lah, anjaza wa’dahu wanasara ‘abdahu wahazamal ahzaba wahdah, la ilaha illallahu wala na’ buduilla iyyahu mukhilisina lahuddina walau karihal kafirun",
      "translasi": "Allah Mahabesar, Allah Mahabesar, Allah Mahabesar. Segala puji untuk Allah, Allah Mahabesar, atas petunjuk yang diberikan-Nya kepada kami, segala puji untuk Alloh atas karunia yang telah dianugerahkan-Nya kepada kami, tak ada Tuhan selain Alloh Yang Maha Esa, tak ada sekutu untuk Nya. untuk-Nya kerajaan dan pujian. Dialah yang menghidupkan dan mematikan, di kekuasaan-Nya lah segala kebaikan dan Dia berkuasa atas segala sesuatu, Tiada Tuhan Selain Alloh Yang Maha Esa, tak ada sekutu untuk-Nya, yang telah menepati janji-Nya, menolong hamba-Nya dan menghancurkan sendiri musuh-musuh-Nya, tak ada Tuhan selain Alloh dan kami tak menyembah kecuali kepada-Nya dengan memurnikan (ikhlas) kepatuhan semata kepada-Nya,  walaupun orang- orang kafir membenci"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Doa Sa’i Perjalanan",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ , أَللهُ أَكْبَرُ كَبِيْراً وَالحَمْدُ ِللهِ كَثِيْراً وَسُبْحاَنَ اللهِ العَظِيْمِ وَبِحَمْدِهِ الكَرِيْمِ بُكْرَةً وَأَصِيْلاً وَمِنَ اللَّيْلِ فاَسْجُدْ لَهُ وَسَبِّحْهُ لَيْلاً طَوِيْلاً لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزاَبَ وَحْدَهُ لاَ شَيْءَ قَبْلَهُ وَلاَ بَعْدَهُ يُحْيِى وَيُمِيْتُ وَهُوَ حَيٌّ داَئِمٌ لاَ يَمُوْتُ وَلاَ يَفُوْتُ أَبَداً بِيَدِهِ الخَيْرُ وَإِلَيْهِ المَصِيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
      "transliterasi": "Allahu Akbar Allahu Akbar Allahu Akbar Allahu Akbar kabira, walhamdu lillahi kasira. Wasubhaanallahil’azimi wabiham dihil karimi bukratawwa asila. Waminal laili fasyjud lahu wasabbih-hu lailan tawila. La ilaha illallahu wahdah anjaza wa’dah. Wanasara ‘abdah wahazamal ahzaba wahdah. La syai a qablahu wala ba’dahu Yuhyii wayumiitu wahuwa hayyun daa imun layamutu walayafutu abada. Biyadihil khairu wailaihil masiir. Wahuwa’ala kulli syai in qadir",
      "translasi": "Allah Maha Besar Allah Maha Besar Allah Maha Besar, Allah Maha Besar dengan segala kebesaraNya. Segala puji untuk Allah Yang Maha Agung dengan segala pujianNya yang tak terhingga. Maha Suci Allah dengan pujian Yang Maha Mulia diwaktu pagi dan petang. Bersujud dan bertasbihlah padaNya sepanjang malam. tak ada Tuhan selain Allah Yang Maha Esa yang menepati janjiNya membela hamba-hmbaNya yang menghancurkan musuh-musuhNya dengan keEsaanNya tak ada sesuatu sebelumNya dengan keEsaanNya, tak ada sesuatu sebelumNya atau sesudahNya. Dialah yang menghidupkan dan mematikandan Dia merupakan Maha Hidup kekal tiada mati dan tiada musnah (hilang) untuk selama-lamanya. Hanya ditanganNyalah terletak kebajikan dan kepadaNyalah tempat kembali dan hanya Dialah Yang Maha Kuasa atas segala sesuatu."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Diantara dua pilar hijau membaca do’a",
      "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ وَتَجاَوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ ماَلاَ نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الأَعَزُّ الأَكْرَمُ .",
      "transliterasi": "Rabbighfir warham wa'fu watakarram watajaawaz 'ammaa ta'lamu, innaka ta'lamu, mala na'lamu, Innaka antallahul a'azzul akram.",
      "translasi": "Ya Allah, ampunilah, sayangilah, maafkanlah, bermurah hatilah dan hapuskanlah apa-apa yang Engkau ketahui dari dosakami. Sesungguhnya Engkau Maha Mengetahui apa-apa yang kami sendiri tak tahu. Sesungguhnya Engkau ya Allah Maha Tinggi dan Maha Pemurah."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Dan ketika mendekati bukit Marwah bacalah",
      "arab": "إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Inna Safa walMarwata min sya'airillah. Faman hajjal bita awi'tamara fala junaha 'alaihi ayyatawwafa bihima. Waman tatawwa'a khairan fainnallaha syakirun 'alim.",
      "translasi": "Sesungguhnya safa dan marwah sebagian dari syi'ar-syi'ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah haji ke Baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa'i antara keduanya. dan barang siapa mengerjakan sesuatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha menerima kebaikan dan Maha Mengetahui"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Perjalanan kedua dari Marwah ke Safa membaca",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ وَ ِللهِ الحَمْدُ لاَ إِلَهَ إِلاَّ اللهُ الواَحِدُ الفَرْدُ الصَّمَدُ الَّذِى لَمْ يَتَّخِذْ صاَحِبَةً وَلاَ وَلَداً وَلَمْ يَكُنْ لَهُ شَرِيْكٌ فىِ الْمُلْكِ وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيْراً .أَللَّـهُمَّ إِنَّكَ قُلْتَ فىِ كِتاَبِكَ الْمُنَزَّلِ أُدْعُوْنِى أَسْتَجِبْ لَكُمْ دَعَوْناَكَ رَبَّناَ فاَغْفِرْ لَناَ كَماَ أَمَرْتَناَ إِنَّاكَ لَا تُخْلِيْفُ المِيْعاَدَ . رَبَّناَ إِنَّناَ سَمِعْناَ مُناَدِياً يُناَدِى لِلإِيْماَنِ أَنْ آمِنُوْا بِرَبِّكُمْ فَآَمَنّاَ , رَبَّناَ فاَغْفِرْ لَناَ ذُنُوْبَناَ وَكَفِّرْ عَنَّا سَيِّئَاتِناَ وَتَوَفَّناَ مَعَ الأَبْراَرِ , رَبَّناَ وَأَتِناَ ماَ وَعَدْتَناَ عَلَى رُسُلِكَ وَلاَ تُخْزِناَ يَوْمَ القِياَمَةِ إِنَّكَ لَا تُخْلِفُ الْمِيْعاَدَ . رَبَّناَ عَلَيْكَ تَوَكَّلْناَ وَإِلَيْكَ أَنَبْناَ وَإَلَيْكَ الْمَصِيْرُ . رَبَّناَ اغْفِرْ لَناَ ذُنُوْبَناَ وَ ِلإِخْواَنِناَ الَّذِيْنَ سَبَقُوْناَ بِالإِيْماَنِ وَلاَ تَجْعَلْ فىِ قُلُوْبِناَ غِلاًّ لِّلَّذِيْنَ أَمَنُوْا رَبَّناَ إِنَّاكَ رَءُوْفٌ رَّحِيْمٌ",
      "transliterasi": "Allahu Akbar Allahu Akbar Allahu Akbar walillahil hamdu. Laa ilaaha illallaahul waahidul fardus shamad. Allazi lam yattakhiz shaahibatan walaa waladan walam yakun lahu syarikun fil mulki walam ya kun lahu waliyyun minazzulli wakabbirhu takbira. Allahumma innaka kulta fi kitabikal munazali ud'uni astajib lakum da'aunaka rabbana `fagfir lana kama amartana innaka latukhliful mi'ad. Rabbana innana sami'na munadiyan yunadi lil imani anaminu birabbikum fa'amanna. Rabana fagfirlana zunubana wa kaffir 'anna sayyiatina watawaffana ma'al abrar. rabbana wa atina mawa'ad tana ala rusulika wala tukhzina yaumal qiyamati innaka latukhliful mi'ad. Rabbana 'alaika tawakkalna wailaika anabna wailaikal masir. Rabbanagfirlana zunuwali ikhwaninal lazina sabaquna bil imani wala taj'al fi qulubina gillal lillazina amanu rabbana innaka ra ufurrahim",
      "translasi": "Allah Maha Besar, Allah maha Besar, Allah Maha Besar, hanya untuk Allahlah segala pujian. tak ada Tuhan selain Allah Yang Maha Esa. Tumpuan segala maksud dan hajat. tak beristri dan tak beranak, tak bersekutu dalam kekuasaan. tak menjadi pelindung kehinaan. Agungkanlah Dia dengan segenap kebesaran. Ya Allah, sesungguhnya Engkau telah berfirman dalam Qur'anMu :\"Berdo'alah kepadaKu niscaya akan Kuperkenankan bagimu\". Sekarang kami telah memohon kepadaMu wahai Tuhan kami. Ampunilah kami seperti halnya Engkau telah perintahkan kepada kami., sesungguhnya Engkau tak akan memungkiri janji. Ya Tuhan kami, sesungguhnya kami mendengar (seruan) yang menyeru kepada iman (yaitu)\"berimanlah kita kepada Tuhanmu\", maka kamipun beriman. Ya Tuhan kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami dan wafatkanlah kami beserta orang-orang yang berbakti. Ya Tuhan kami berilah kami apa yang Engkau telah janjikan kepada kami dengan perantaraan rasul-rasul Engkau. Dan janganlah Engkau hinakan kmi di hari kiamat. Sesungguhnya Engkau tak menyalahi janji. Ya Allah, hanya kepada Engkaulah kami bertawakal, dan hanya kepada Engkaulah tumpuan segala sesuatu dan kepada Engkaulah tempat kembali. Ya Allah, ampunilh kami serta semua saudara kami yang telah mendahului kami beriman kepada Engkau dan jangan menjadikn kedengkian dalam kalbu kami terhadap mereka yang telah beriman. Ya Allah, sesungguhnya Engkau Maha Pengasih dan Maha Penyayang."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Di antara dua pilar hijau membaca do’a",
      "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ وَتَجاَوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ ماَلاَ نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الأَعَزُّ الأَكْرَمُ .",
      "transliterasi": "Rabbighfir warham wa'fu watakarram watajaawaz 'ammaa ta'lamu, innaka ta'lamu, mala na'lamu, Innaka antallahul a'azzul akram.",
      "translasi": "Ya Allah, ampunilah, sayangilah, maafkanlah, bermurah hatilah dan hapuskanlah apa-apa yang Engkau ketahui dari dosakami. Sesungguhnya Engkau Maha Mengetahui apa-apa yang kami sendiri tak tahu. Sesungguhnya Engkau ya Allah Maha Tinggi dan Maha Pemurah."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Dan ketika mendekati bukit Safa membaca",
      "arab": "إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Inna Safa walMarwata min sya'airillah. Faman hajjal bita awi'tamara fala junaha 'alaihi ayyatawwafa bihima. Waman tatawwa'a khairan fainnallaha syakirun 'alim.",
      "translasi": "Sesungguhnya safa dan marwah sebagian dari syi'ar-syi'ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah haji ke Baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa'i antara keduanya. dan barang siapa mengerjakan sesuatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha menerima kebaikan dan Maha Mengetahui"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Perjalanan ketiga dari Safa ke Marwah membaca",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ وَ ِللهِ الحَمْدُ رَبَّناَ أَتْمِمْ لَناَ نُوْرَناَ وَاغْفِرْ لَناَ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ . أَللَّـهُمَّ إِنِّى أَسْأَلُكَ الخَيْرَ كُلَّهُ عاَجِلَهُ وَأَجِلَهُ وَأَسْتَغْفِرُكَ لِذَنْبِى وَأَسْأَلُكَ رَحْمَتَكَ ياَ أَرْحَمَ الرَّحِمِيْنَ .",
      "transliterasi": "Allahu akbar Allahu Akbar Allahu Akbar walillahil hamdu Rabbana atmim lana nurana waghfirlana innaka 'ala kulli syai in qadir. Allahumma inni as alukal khaira kullahu ajilahu wa ajilahu wa astagfiruka lizanbi waasaluka rahmataka ya arhamar rahimin",
      "translasi": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Hanya untuk Allah semua pujian. Ya Allah sempurnakanlah cahaya terang untuk kami, ampunilah kami, sesungguhnya Engkau Maha Kuasa Atas segala sesuatu. Ya Allah, sesungguhnya aku mohon padaMu segala kebaikan yang Cepet atau lambat dan aku mohon ampunan padaMU akan dosaku serta aku mohon padaMu rahmatMu wahai Tuhan yang Maha Pengasih dari segenap yang pengasih"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Diantara dua pilar hijau membaca do’a",
      "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ وَتَجاَوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ ماَلاَ نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الأَعَزُّ الأَكْرَمُ .",
      "transliterasi": "Rabbighfir warham wa'fu watakarram watajaawaz 'ammaa ta'lamu, innaka ta'lamu, mala na'lamu, Innaka antallahul a'azzul akram.",
      "translasi": "Ya Allah, ampunilah, sayangilah, maafkanlah, bermurah hatilah dan hapuskanlah apa-apa yang Engkau ketahui dari dosakami. Sesungguhnya Engkau Maha Mengetahui apa-apa yang kami sendiri tak tahu. Sesungguhnya Engkau ya Allah Maha Tinggi dan Maha Pemurah."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Dan ketika mendekati bukit Marwah membaca",
      "arab": "إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Inna Safa walMarwata min sya'airillah. Faman hajjal bita awi'tamara fala junaha 'alaihi ayyatawwafa bihima. Waman tatawwa'a khairan fainnallaha syakirun 'alim.",
      "translasi": "Sesungguhnya safa dan marwah sebagian dari syi'ar-syi'ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah haji ke Baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa'i antara keduanya. dan barang siapa mengerjakan sesuatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha menerima kebaikan dan Maha Mengetahui"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Perjalanan keempat dari Marwah ke Safa membaca",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ وَ ِللهِ الحَمْدُ أَللَّـهُمَّ إِنِّى أَسْأَلُكَ مِنْ خَيْرِ ماَتَعْلَمُ وَأَعُوْذُ بِكَ مِنْ شَرِّ ماَ تَعْلَمُ وأَسْتَغْفِرُكَ مِنْ كُلِّ ماَ تَعْلَمُ إِنَّاكَ أَنْتَ عَلاَّمُ الغُيُوْبِ , لاَ إِلَهَ إِلاَّ اللهُ المَلِكُ الحَقُّ المُبِيْنُ , مُحَمَّدٌ رَسُوْلُ اللهِ صاَدِقُ الوَعْدِ الأَمِيْنُ . أَللَّـهُمَّ إِنِّى أَسْأَلُكَ كَماَ هَدَيْتَنِى لِلإِسْلاَمِ أَنْ لاَتَنْزِعَهُ مِنِّى حَتَّى تَتَوَفَّنِى وَأَناَ مُسْلِمٌ , أَللّهُمَّ اجْعَلْ فىِ قَلْبِى نُوْراً وَفىِ سَمْعِى نُوْراً وَفىِ بَشَرِى نُوْراً , أَللَّـهُمَّ اشْرَحْ لىِ صَدْرِى وَيَسِّرْ لىِ أَمْرِى وَأَعُوْذُ بِكَ مِنْ وَساَوِسِ الصَّدْرِ وَشَتاَتِ الأَمْرِ وَفِتْنَةِ القَبْرِ , أَللَّـهُمَّ إِنِّى أَعُوْذُ بِكَ مِنْ شَرِّ ماَ يَلِجُ فىِ اللَّيْلِ وَشَرِّ ماَ يَلِجُ فىِ النَّهاَرِ وَمِنْ شَرِّ ماَ تَهُبُّ بِهِ الرِّياَحُ ياَ أَرْحَمَ الرَّحِمِيْنَ . سُبْحاَنَكَ ماَ عَبَدْناَكَ حَقَّ عِباَدَتِكَ ياَ أَللهُ سُبْحاَنَكَ ماَذَكَرْناَكَ حَقَّ ذِكْرِكَ ياَ أَللهُ .",
      "transliterasi": "Allahu Akbar Allahu Akbar Allahu Akbar walillahil hamdu. Allahumma inni as aluka min khairi ma ta'lamu wa a'uzubika min syarri mata'lamu wa astagfiruka min kulli mata'lamu innaka anta 'allamul guyub. La ilaha illallahul malikul haqqul mubin. Muhammadur rasulullah sadiqul wa'dil amin. Allahumma inni as aluka kama haditani lil islami an la tanzi 'ahu minni hatta tatawaffani wa ana muslimun. Allahummaj'al fi qalbi nura. Allahummasyroh li sadri wayassirli amri wa a'uzubika min wasawisis sadri wasyatatil amri wafit natil qabri. Allahumma inni a'uzubika min syarri ma yaliju fillaili wa syarri ma yaliju finnahari wamin syarri matahubbu bihir riyahu ya arhamar rahimin. Subhanaka ma 'abadnaka haqqa ibadatika ya Allahu Subhanaka ma zakarnaka haqqa zikrika ya Allahu.",
      "translasi": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Segala puji untuk Allah. Ya Allah Tuhanku, aku mohon padaMu dari kebaikan yang Engkau tahu dan berlindung padaMu dari kejahatan yang Engkau tahu, dan aku mohon ampun padaMu dri segala kesalahan yang Engkau ketahui, sesungguhnya Engkau Maha mengetahui yang gaib. tak ada Tuhan selain Allah Maha Raja yang sebenar-benarnya. Muhammad utusan Allah yang selalu menepati janji lagi terpercaya. Ya Allah sebagaimana Engkau telah menunjuki aku memilih Islam, maka aku mohon kepadaMu untuk tak mencabutnya sehingga aku meninggal dalam keadaan Muslim. Ya Allah berilah cahay terang dalam hati, telinga dan penglihatanku. Ya Allah lapangkanlah dadaku dan mudahkan bagiku segala urusan. Dan aku berlindung padaMu dari keraguan, simpang-siur urusan dan fitnah kubur. Ya Allah aku berlindung padaMu dari kejahatan yang tersembunyi diwaktu malam dan siang hari, serta kejahatn yang dibawa angin lalu, wahai Tuhan Yang Maha Pengasih dari segenap yang pengasih. Ya Allah, Maha Suci Engkau kami tak menyembahMu dengan Darma yang semestinya ya Allah"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Diantara dua pilar hijau membaca do’a",
      "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ وَتَجاَوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ ماَلاَ نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الأَعَزُّ الأَكْرَمُ .",
      "transliterasi": "Rabbighfir warham wa'fu watakarram watajaawaz 'ammaa ta'lamu, innaka ta'lamu, mala na'lamu, Innaka antallahul a'azzul akram.",
      "translasi": "Ya Allah, ampunilah, sayangilah, maafkanlah, bermurah hatilah dan hapuskanlah apa-apa yang Engkau ketahui dari dosakami. Sesungguhnya Engkau Maha Mengetahui apa-apa yang kami sendiri tak tahu. Sesungguhnya Engkau ya Allah Maha Tinggi dan Maha Pemurah."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Dan ketika mendekati bukit Safa membaca",
      "arab": "إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Inna Safa walMarwata min sya'airillah. Faman hajjal bita awi'tamara fala junaha 'alaihi ayyatawwafa bihima. Waman tatawwa'a khairan fainnallaha syakirun 'alim.",
      "translasi": "Sesungguhnya safa dan marwah sebagian dari syi'ar-syi'ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah haji ke Baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa'i antara keduanya. dan barang siapa mengerjakan sesuatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha menerima kebaikan dan Maha Mengetahui"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Perjalanan kelima dari Safa ke Marwah membaca",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ وَ ِللهِ الحَمْدُ سُبْحاَنَكَ ماَ أَعْلَى شَأْنَكَ ياَ أَللهُ , أَللَّـهُمَّ حَبِّبْ إِلَيْناَ الإِيْماَنَ وَزَيِّنْهُ فىِ قُلُوْبِناَ وَكَرِّهْ إِلَيْناَ الكُفْرَ وَالفُسُوْقَ وَالعِصْياَنَ وَاجْعَلْناَ مِنَ الرَّاشِدِيْنَ",
      "transliterasi": "Allahu Akbar Allahu Akbar Allahu Akbar walillahil hamdu. Subhanaka ma syakarnaaka haqqa syukrika ya Allahu subhanaka ma a'la sya'naka ya Allahu. Allahumma habbib ilainal imana wa zayyinhu fi qulubina wakarrih ilainal kufra walfu suqa wal'isyana waj'alna minar rasyidin.",
      "translasi": "Allah Maha Besar Allah Maha Besar Allah Maha Besar. Hanya untuk Allah segala puji. Maha Suci Engkau seperti kami bersyukur di-Mu sebenar-benar syukur wahai Allah. Maha Suci Engkau sepadan ketinggian-Mu wahai Allah. Ya Allah cintakanlah kami kepada iman dan hiaskanlah di hati kami, bencikanlah kami di perbuatan kufur, fasiq dan durhaka. Masukanlah kami kedalam golongan orang-orang yang mendapat petunjuk."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Diantara dua pilar hijau membaca do’a",
      "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ وَتَجاَوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ ماَلاَ نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الأَعَزُّ الأَكْرَمُ .",
      "transliterasi": "Rabbighfir warham wa'fu watakarram watajaawaz 'ammaa ta'lamu, innaka ta'lamu, mala na'lamu, Innaka antallahul a'azzul akram.",
      "translasi": "Ya Allah, ampunilah, sayangilah, maafkanlah, bermurah hatilah dan hapuskanlah apa-apa yang Engkau ketahui dari dosakami. Sesungguhnya Engkau Maha Mengetahui apa-apa yang kami sendiri tak tahu. Sesungguhnya Engkau ya Allah Maha Tinggi dan Maha Pemurah."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Dan ketika mendekati bukit Marwah membaca",
      "arab": "إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Inna Safa walMarwata min sya'airillah. Faman hajjal bita awi'tamara fala junaha 'alaihi ayyatawwafa bihima. Waman tatawwa'a khairan fainnallaha syakirun 'alim.",
      "translasi": "Sesungguhnya safa dan marwah sebagian dari syi'ar-syi'ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah haji ke Baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa'i antara keduanya. dan barang siapa mengerjakan sesuatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha menerima kebaikan dan Maha Mengetahui"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Perjalanan keenam dari Marwah ke Safa",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ وَ ِللهِ الحَمْدُ لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزاَبَ وَحْدَهُ لاَ إِلَهَ إِلاَّ اللهُ وَلاَ نَعْبُدُ إِلاَّ إِياَّهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الكاَفِرُوْنَ . أَللَّـهُمَّ إِنِّى أَسْأَلُكَ الهُدَى وَالتُّقَى وَالعَفاَفَ وَالغِنَى , أَللَّـهُمَّ لَكَ الحَمْدُ كاَلَّذِىْ نَقُوْلُ وَخَيْراً مِمَّا نَقُوْلُ , أَللَّـهُمَّ إِنِّى أَسْأَلُكَ رِضاَكَ وَالجَنَّةَ وَأَعُوْذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ وَماَ يُقَرِّبنُِى إِلَيْهاَ مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ . أَللَّـهُمَّ بِنُوْرِكَ اهْتَدَيْناَ وَبِفَضْلِكَ اسْتَغْنَيْناَ وَفىِ كَنَفِكَ وَإِنْعاَمِكَ وَعَطاَئِكَ وَإِحْساَنِكَ أَصْبَحْناَ وَأَمْسَيْناَ أَنْتَ الأَوَّلُ فَلاَ قَبْلَكَ شَيْءٌ وَالأَخِرُ فَلاَ بَعْدَكَ شَيْءٌ وَالظَّاهِرُ فَلاَ شَيْءَ فَوْقَكَ وَالباَطِنُ فَلاَ شَيْءَ دُوْنَكَ نَعُوْذُ بِكَ مِنَ الفَلَسِ وَالكَسَلِ وَعَذاَبِ القَبْرِ وَفِتْنَةِ الغِنَى وَنَسْأَلُكَ الفَوْزَ بِالجَنَّةِ",
      "transliterasi": "Allahu Akbar Allahu Akbar Allahu Akbar walillahil hamdu. La ilaha illallahu wahdah, sadaqa wa'dah, wanasara 'abdah wahazamal ahzaba wahdah. La ilaha illallahu wala na'budu illa iyyahu mukhlisina lahuddina walau karihal kafirun. Allahumma inni 'as'alukal huda wattuqa wal 'afafa walghina. Allahumma lakal hamdu kallazi naqulu wakhairan mimma naqulu. Allahumma inni as'aluka ridaka waljannata wa a'uzubika min sakhatika wannari wama yuqarribuni ilaiha min qaulin aufi'lin au'a malin. Allahumma binurikah tadaina wabifadlika istagnaina wa fi kanafika wa in amika wa'ata ika wa ihsanika asbahna wa amsaina antal awwalu fala qablaka syai'un wal akhiru fala ba'daka syai'un wazzahiru fala syai'a dunaka na'uzubika minal falasi wal kasali wa'azabil qabri wafitnatil gina wa nas'alukal fauza biljannah.",
      "translasi": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar Segala puji hanya untuk Allah. tak ada Tuhan selain Allah Yang Maha Esa, yang menepati janjiNya, menolong hambaNya dan menghancurkan musuh dengan ke-Esaan-Nya. Tiada Tuhan yang disembah selain Allah. Dan kami tak menyembah selain dari Dia dengan ikhlas tunduk dan patuh di agama sekalipun orang-orang kafir benci. Ya Allah aku mohon padaMu petunjuk, pemeliharaan, penjagaan dan Harta. Ya Allah, padaMu lah segala puji seperti yang kami ucapkan bahkan lebih bagus dari yang kami sendiri ucapkan. Ya Allah, kami mohon padaMu ridho dan surga dan aku berlindung padaMu dari murkaMu dan neraka, dan apapun yang kekal yang mendekatkan daku kepadanya, bagus ucapan, perbuatan ataupun pekerjaan. Ya Allah, hanya dengan nur cahayaMu kami ini mendapat petunjuk, dengan pemberianMu kami merasa cukup, dalam naunganMu, nikmatMu, anugerahMu dan kebajikannMu jualah kami ini berada diwaktu pagi dan petang. Engkaulah yang mula pertama, tak ada suatupun yang ada sebelumMu dan Engkau pulalah yang paling akhir dan tak ada sesuatupun yang ada sebelumMu dan Engkau pulalah yang paling akhir dan tak ada sesuatupun yang ada dibelakangMu. Engkaulah yang dzahir, maka tak ada sesuatupun yang mengatasi Engkau. Engkau pulalah yang batin, maka tak ada sesuatupun menghalangi Engkau. Kami berlindung padaMu dari pailit, malas,siksa kubur dan fitnah Harta serta kami mohon padaMu kemenangan memperoleh surga."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Diantara dua pilar hijau membaca do’a",
      "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ وَتَجاَوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ ماَلاَ نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الأَعَزُّ الأَكْرَمُ .",
      "transliterasi": "Rabbighfir warham wa'fu watakarram watajaawaz 'ammaa ta'lamu, innaka ta'lamu, mala na'lamu, Innaka antallahul a'azzul akram.",
      "translasi": "Ya Allah, ampunilah, sayangilah, maafkanlah, bermurah hatilah dan hapuskanlah apa-apa yang Engkau ketahui dari dosakami. Sesungguhnya Engkau Maha Mengetahui apa-apa yang kami sendiri tak tahu. Sesungguhnya Engkau ya Allah Maha Tinggi dan Maha Pemurah."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Dan ketika mendekati bukit Safa membaca",
      "arab": "إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Inna Safa walMarwata min sya'airillah. Faman hajjal bita awi'tamara fala junaha 'alaihi ayyatawwafa bihima. Waman tatawwa'a khairan fainnallaha syakirun 'alim.",
      "translasi": "Sesungguhnya safa dan marwah sebagian dari syi'ar-syi'ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah haji ke Baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa'i antara keduanya. dan barang siapa mengerjakan sesuatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha menerima kebaikan dan Maha Mengetahui"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Perjalanan ketujuh dari Safa ke Marwah membaca",
      "arab": "أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ أَللهُ أَكْبَرُ كَبِيْراً وَالحَمْدُ ِللهِ كَثِيْراً , أَللَّـهُمَّ حَبِّبْ إِلَيَّ الإِيْماَنَ وَزَيِّنْهُ فىِ قَلْبِى وَكَرِّهْ إِلَيَّ الكُفْرَ وَالفُسُوْقَ وَالعِصْياَنَ وَاجْعَلْنِى مِنَ الرَّاشِدِيْنَ",
      "transliterasi": "Allahu Akbar Allahu Akbar Allahu Akbar kabira walhamdu lillahi kasira. Allahumma habbib ilayyal imana wazayyinhu fi qalbi wakarrih ilayyal kufra wal fusuqa wal 'isyana waj'alni minar rasyidin",
      "translasi": "Allah Maha Besar Allah Maha Besar Allah Maha Besar. Segala puji kembali kepada Allah. Ya Allah cintakanlah aku kepada iman, hiaskanlah ia dikalbuku. Bencikanlah padaku perbuatan kufur, fasiq dan durhaka. Dan masukkanlah pula aku dalam golongan orang yang mendapat petunjuk."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Diantara dua pilar hijau membaca do’a",
      "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ وَتَجاَوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ ماَلاَ نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الأَعَزُّ الأَكْرَمُ .",
      "transliterasi": "Rabbighfir warham wa'fu watakarram watajaawaz 'ammaa ta'lamu, innaka ta'lamu, mala na'lamu, Innaka antallahul a'azzul akram.",
      "translasi": "Ya Allah, ampunilah, sayangilah, maafkanlah, bermurah hatilah dan hapuskanlah apa-apa yang Engkau ketahui dari dosakami. Sesungguhnya Engkau Maha Mengetahui apa-apa yang kami sendiri tak tahu. Sesungguhnya Engkau ya Allah Maha Tinggi dan Maha Pemurah."
    },
    {
      "title": "doa sa'i",
      "subtitle": "Dan ketika mendekati bukit Marwah membaca",
      "arab": "إِنَّ الصَّفاَ وَالمَرْوَةَ مِنْ شَعَآئِرِ اللهِ , فَمَنْ حَجَّ البَيْتَ أَوِاعْتَمَرَ فَلاَجُناَحَ عَلَيْهِ أَنْ يَّطَّوَّفَ بِهِماَ وَمَنْ تَطَوَّعَ خَيْراً فَإِنَّ اللهَ شاَكِرٌ عَلِيْمٌ .",
      "transliterasi": "Inna Safa walMarwata min sya'airillah. Faman hajjal bita awi'tamara fala junaha 'alaihi ayyatawwafa bihima. Waman tatawwa'a khairan fainnallaha syakirun 'alim.",
      "translasi": "Sesungguhnya safa dan marwah sebagian dari syi'ar-syi'ar (Asterik kebesaran) Allah. Maka barang siapa yang beribadah haji ke Baitullah ataupun berumrah, maka tak ada dosa baginya mengerjakan sa'i antara keduanya. dan barang siapa mengerjakan sesuatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Maha menerima kebaikan dan Maha Mengetahui"
    },
    {
      "title": "doa sa'i",
      "subtitle": "Do’a di bukit Marwah selesai Sa’i",
      "arab": "أَللَّـهُمَّ رَبَّناَ تَقَبَّلْ مِنَّا وَعاَفِناَ وَاعْفُ عَنَّا وَعَلَى طاَعَتِكَ وَشُكْرِكَ أَعِنَّا وَعَلَى غَيْرِكَ لاَ تَكِلْناَ وَعَلَى الإِيْماَنِ وَالإِسْلاَمِ الكاَمِلِ جَمِيْعاً تَوَفَّناَ وَأَنْتَ راَضٍ عَنَّا أَللَّـهُمَّ ارْحَمْنِى بِتَرْكِ المَعاَصِى أَبَداً ماَ أَبْقَيْتَنِى وَارْحَمْنِى أَنْ أَتَكَلَّفَ ماَ لاَ يَعْنِيْنِى وَارْزُقْنِى حُسْنَ النَّظَرِ فِيْماَ يُرْضِيْكَ عَنِّى ياَ أَرْحَمَ الرَّاحِمِيْنَ .",
      "transliterasi": "Do'a di Bukit Marwah selesai Sa'i: \"Allahumma rabbana taqabbal minna wa'afina wa,fu 'anna wa'ala tha atika wasyukrika a'inna wa'ala ghairika latakilna wa alal imani wal islamil kamili jami'an, tawaffana wa anta radin anna. Allahummar hamni bitarkil ma'asi abadan ma abqaitani warhamni an atakalaffa ma la ya'nini warzugni husnan nazari fima yurdika anni ya arhamar rahimin",
      "translasi": "Ya Allah kami mohon diterima do'a kami, afiatkan dan ampunilah kami, berilah pertolongan kepada kami untuk taat dan bersyukur kepadaMu. Janganlah Engkau jadikan kami bergantung selain kepadaMu. Matikanlah kami dalam Islam yang sempurna dalam keridhaanMu. Ya Allah rahmatilah diri kami sehingga mampu meninggalkan segala kejahatan selama hidup kami, dan rahmatilah diri kami sehingga tak berbuat hal yang tak bermanfaat. Karuniakanlah kepada kami keridhaanMu. Wahai Tuhan yang bersifat Maha Pengasih lagi Penyayang."
    },
    {
      "title": "doa menggunting rambut",
      "subtitle": "",
      "arab": "اللَّهُمَّ اجْعَلْ لِكُلِّ شَعْرٍ نْورًا يَوْمَ القِيَامَةِ",
      "transliterasi": "Allahummaj’al likuli sya’ratin nuuran yaumal qiyaamati",
      "translasi": "Ya Allah, jadikanlah cahaya untuk setiap helai rambut yang aku potong ini pada hari kiamat nanti."
    },
    {
      "title": "Doa setelah menggunting rambut",
      "subtitle": "",
      "arab": "الحَمْدُ للهِ الَّذِي قضَى عَنَّا مَنَاسِكَنَا اللَّهُمَّ إِيمَاًنا وَيَقِينًا وَعَوْنًا وَاغْفِرْلنَا وَلِوَالِدَيْنَا ولِسَائِرِ المُسْلِمِينَ وَالمُسْلِمَاتِ",
      "transliterasi": "Alhamdulillaahil ladzii qadhaa ‘annaa manaasikanaa. Allahumma zidnaa iimaanan wa yaqiinan wa ‘aunan waghfir lanaa wa liwaalidainaa wa lisaa’iri muslimiiina wal muslimaati",
      "translasi": "Segala puji bagi Allah yang telah menyelesaikan manasik kami. Ya Allah, tambahkanlah kepada kami iman, keyakinan dan pertolongan serta ampunilah kami, kedua orangtua kami dan seluruh kaum muslimin dan muslimat."
    },
    {
      "title": "doa masuk arafah",
      "subtitle": "",
      "arab": "اللَّهُمَّ إِلَيْكَ تَوَجَّهْتُ، وَبِكَ اعْتَصَمْتُ، وَعَلَيْكَ تَوَكَّلْتُ . اللَّهُمَّ اجْعَلْنِيْ مِمَّنْ تُبَاهِيْ بِهِ اليَوْمَ مَلاَئِكَتَكَ، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
      "transliterasi": "Allahummaj’alniiy mimmantubaahiiy bihilyauma malaa ikataka, innaka ‘alaa kulla sya’in qadiirun.",
      "translasi": "Ya Allah, hanya kepada Engkaulah aku menghadap, dengan Engkaulah aku berpegang teguh, pada Engkaulah aku berserah diri. Ya Allah, jadikanlah aku di antara orang yang hari ini Engkau banggakan di hadapan Malaikat-Mu, sesungguhnya Engkau Maha Kuasa atas segala sesuatu."
    },
    {
      "title": "doa wukuf",
      "subtitle": "",
      "arab": "اللَّهُمَّ إلَيْك تَوَجَّهْتُ وَلِوَجْهِكَ الْكَرِيمِ أَرَدْتُ فَاجْعَلْ ذَنْبِي مَغْفُورًا وَحَجِّي مَبْرُوْرًا وَارْحَمْنِي، وَلَا تُخَيِّبْنِي إنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
      "transliterasi": "Allāhumma ilayka tawajjahtu, wa li wajhikal karīmi aradtu, faj‘al dzanbī maghfūran, wa hajjī mabrūran. Warhamnī, wa lā tukhayyibnī, innaka ‘alā kulli syay’in qadīr.",
      "translasi": "Ya Tuhanku, hanya kepada-Mu aku menghadap, hanya ke wajah-Mu aku menatap, jadikanlah dosaku terampuni dan hajiku termabrurkan. Berikanlah rahmat-Mu padaku. Jangan Engkau menyia-nyiakanku. Sungguh, Engkau maha kuasa atas segala sesuatu,"
    },
    {
      "title": "doa ketika sampai di muzdalifah",
      "subtitle": "",
      "arab": "اللَّهُمَّ إنَّ هَذِهِ مُزْدَلِفَةُ جُمِعَتْ فِيْهَا ألْسِنَةٌ مُخْتَلِفَةٌ نَسْئَلُكَ حَوَائِجَ مُتَنَوِعَةً فَاجْعَلْنِيْ مِمَّنْ دَعَاكَ فَاسْتَجَبْتَ لَهُ وَتَوَكَلْ عَلَيْكَ فَكَفَيْتَهُ يَا اَرْحَمَ الرَّاحِمِيْنَ",
      "transliterasi": "Allahumma inna hadzihi muzdalifatu jumi’at fiihaa alsinatun muhtalifatun, tas’aluka hawaa ija mutanawan ‘atan faj’alnii mimman da’aaka fastajabta lahu watawakkala ‘alaika fakaffaitahu yaa arhamarraahimiin.",
      "translasi": "Ya Allah, sesungguhnya ini Muzdalifah telah berkumpul bermacam-macam bahasa yang memohon kepada-Mu. Hajat keperluan yang aneka ragam. Maka masukkanlah aku kedalam golongan orang yang memohon kepada-Mu, lalu orang yang memohon kepada-Mu, lalu Engkau penuhi permintaannya, yang berserah diri pada-Mu” lalu Engkau lindungi dia. Wahai Tuhan yang Maha Pengasih dari segala yang pengasih."
    },
    {
      "title": "doa ketika sampai di mina",
      "subtitle": "",
      "arab": "اللَّهُمَّ هَذَا مِنَى فَامْنُنْ عَلَيَّ بِمَا مَنَنْتَ بِهِ عَلَى أَوْلِيَائِكَ وَأَهْلِ طَاعَتِكَ",
      "transliterasi": "Allahumma hadzaa mina famnun ‘alayya bimaa mananta bihi ‘ala awliyaa ika wa ahli thaa’atika.",
      "translasi": "Ya Allah, tempat ini adalah di Mina, maka anugerahkanlah aku apa yang Engkau telah anugerahkan kepada orang-orang yang selalu dekat dan taat kepada-Mu."
    },
    {
      "title": "doa melempar jumrah",
      "subtitle": "",
      "arab": "بِسْمِ اللهِ وَاللهُ أَكْبَرُ رَجْمًا لِلشَّيَاطِينِ وَرِضًا لِلَّرْحْمَنِ اللَّهُمَّ اجْعَلْ حَجًّا مَبْرُورًا وَسَعْياً مَشْكُورًا",
      "transliterasi": "Bismillaahi wallahu akbar, rajman lisysyayaathiini wa ridhan lirrahmaani allhummaj’al hajjan mabruuran wa sa’yan masykuuran.",
      "translasi": "Dengan nama Allah, ya Allah, aku memohon kebaikannya, kebaikan pemiliknya, dan kebaikan sesuatu yang ada di dalamnya. Dan aku berlindung kepada-Mu dari keburukannya, keburukan pemiliknya, dan keburukan sesuatu yang ada di dalamnya."
    },
    {
      "title": "doa masuk kota madinah",
      "subtitle": "",
      "arab": "اللَّهُمَّ هَذَا حَرَامُ رَسُولِكَ وَاجْعَلْهُ وِقَايَةً مِنَ النَّارِ َوأَمَنَةً مِنَ الْعَذَابِ وَسُوءَ الحِسَابِ",
      "transliterasi": "Allahumma haadzaa haraamu rasuulila waj’alhu waqaayatan minan naari wa amanatan minal ‘adzaabi wa suu’al hisaabi.",
      "translasi": "Ya Allah, negeri ini adalah tanah haram Rasul Mu Muhammad SAW, maka jadikanlah penjaga bagiku dari neraka, aman dari siksa dan buruknya hisab (perhitungan di hari kemudian).”"
    },
    {
      "title": "doa masuk masjid nabawi",
      "subtitle": "",
      "arab": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ. أَعُوذُ باللهِ العَظِيمِ وَوَجْهِ الكَرِيمِ وَسُلْطَانِهِ القَدِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
      "transliterasi": "Bismillahir rahmaanir rahiim. A’uudzubillahil kariimi wa sulthaanihil qadiimi minasy syaithaanir rajiimi allahummaf tahlii abwaaba rahmatika.",
      "translasi": "Dengan menyebut nama Allah Yang Maha Pengasih dan Maha Penyayang. Aku berlindung kepada Allah yang Maha Agung, kepada wajah-Nya yang Maha Mulia dan kepada kekuasaan-Nya Yang Maha Dahulu dari godaan setan yang terkutuk. Ya Allah, bukakanlah bagiku segla pintu rahmat-Mu"
    },
    {
      "title": "doa ketika pulang haji",
      "subtitle": "",
      "arab": "باسْمِ اللَّهِ اللَّهُمَّ إنِّي أسألُكَ خَيْرَها وَخَيْرَ أهلها وَخَيْرَ ما فِيها وأعُوذُ بِكَ مِنْ شَرّها وَشَرّ أهلها وَشَرّ مَا فِيهَا",
      "transliterasi": "Bismillâh allâhumma innî as-aluka khairahâ wa khaira ahliha wa khaira mâ fîhâ wa a‘ûdzubika min syarrihâ wa syarri ahliha wa syarri mâ fîhâ.",
      "translasi": "Dengan menyebut nama Allah Yang Maha Pengasih dan Maha Penyayang. Aku berlindung kepada Allah yang Maha Agung, kepada wajah-Nya yang Maha Mulia dan kepada kekuasaan-Nya Yang Maha Dahulu dari godaan setan yang terkutuk. Ya Allah, bukakanlah bagiku segla pintu rahmat-Mu"
    },
    {
      "title": "doa salam makam rosulullah",
      "subtitle": "",
      "arab": "السَّلَامُ عَلَيْكُمْ أَيُّهَا النَّبِي وَرَحْمَتُهُ وَبَرَكَاتُهُ اللَّهُمَ أَتِهَ الْوَسِيْلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ المَقَامَ المَحْمُودَ الَّذِي وَعَدَتْهَ الَّلهُمَّ أَجْزِهِ عَنْ أُمَّتِهِ أَفْضَلَ الْجَزَاءِ",
      "transliterasi": "Assalaamu ‘alaikum ayyuhan nabiyyu warahmatuhu wabarakatuhu, allahumma atihil washiilata wal fadhiilata wab’asthul maqaamal mahmuudal ladzii wa’adtahu allahumma ajzihi ‘an ummatihi afdhalal jazaa’.",
      "translasi": "Semoga salama sejahtera , rahmat Allah, dan berkah-Nya terlimpah kepadamu, wahai Nabi Muhammad. Ya Allah, berilah beliau kedudukan tinggi di surga dan kemuliaan, serta bangkitkanlah beliau di tempat yang terpuji yang telah Engkau janjikan kepadanya. Ya Allah, limpahkanlah kepada-Nya sebaik-baik pahala, beliau yang telah menyampaikan risalah kepada umatnya.”"
    },
    {
      "title": "doa salam abu bakar as siddiq",
      "subtitle": "",
      "arab": "السلام عليكم يا خليفة رسول الله، السلام عليك يا صاحب رسول الله في الغار، السلام عليك يا من أنفق ماله كله في حب الله وحب رسول الله جزاك الله عن أمة رسول الله خير الجزاء ولقد خلفت رسول الله أحسن الخلف وسلكت طريقه ومنهاجه خير سلوك ونصرت الإسلام ووصلت الأرحام ولم تزل قائما بالحق حتى أتاك اليقين",
      "transliterasi": "Assalaamu ‘alaika yaa khaliifata rasulillaah. Assalaamu ‘alaika yaa shaahiba rasuulillaahi fil ghaari. Assalaamu’alaika yaa man anfaqa maalahu kullahu fi hubbillaahi wa hubbi rasuulillaahi jazaakallahu ‘an ummati rasuulillaahi khairal jazaa’i. Wa laqad khalaqta rasuulillaahi ahsanal khalaf. Wa salakta thariiqahu wa minhaajahu khaira suluukin wa nashartal islaama wa wahsaltal arhaama walam tazal qaa’iman bil haqqi hattaa ataakal yaqiinu. Assalaamu’alaika wa rahmatullaahi wabarakaatuh.",
      "translasi": "Selamat sejahtera padamu, wahai khalifah Rasullillah. Selamat sejahtera padamu wahai orang yang mendarmakan seluruh hartanya karena cintanya kepada Allah dan Rasul-Nya. Semoga Allah membalas dengan sebaik-baik balasan dari umat Rasulullah dan sungguh engkau telah menggantikan Rasulullah sebagai khalifah yang baik. dan engkau telah menempuh jalan dan jejaknya dengan sebaik-baiknya, engkau telah membela Islam, engkau telah menghubungkan silaturrahmi dan engkau senantiasa menegakkan kebenaran sampai akhir hayat. Maka, selamat dan sejahtera padamu dan rahmat serta berkat Allah juga untukmu."
    },
    {
      "title": "doa salam umar bin",
      "subtitle": "",
      "arab": "السلام عليك يا مظهر الإسلام، السلام عليك يا فاروق، السلام عليك يا من نظقت بالصواب وكفلت الأيتام ووصلت الأرحام وقوي بك الإسلام، السلام عليك ورحمة الله وبركاته",
      "transliterasi": "Assalaamu ‘alaika yaa muzhhiral islaam, assalaamu ‘alaika yaa faaruuq, assalaamu ‘alaika yaa man nathaqat bish shawaaabbi wa kafaltal aytaama wa washalal arhaama wa qawiya bikal islaam, assalaamu’alaika wa rahmatullahi wa barakaatuh",
      "translasi": "Salam sejahtera padamu, wahai penyebar Islam. Salam sejahtera padamu, wahai orang yang tegas membedakan antara yang benar dan yang salah. Salam sejahtera padamu wahai orang yang yang selalu berkata benar dan menjamin anak yatim. Engkau telah menghubungkan silaturrahmi dan denganmu lah Islam menjadi kuat. Salam sejahtera dan semoga rahmat Allah tercurah padamu."
    },
    {
      "title": "doa salam ustman",
      "subtitle": "",
      "arab": "السلام عليك يا ذا النورين عثمان ابن عفان، السلام عليك يا ثالث الخلفاء الراشدين، السلام عليك يا مجهز جيش العسرۃ بالنقد والعين، وجامع القران بين الدفتين، جزاك ﷲ عن امۃ رسول ﷲ صلی ﷲ عليه وسلم خير الجزاء، اللهم ارض عنه وارفع درجته واكرم مقامه و اجزل ثوابه",
      "transliterasi": "Assalamu ‘alaika yaa dzan nuuraini ‘utsmaana ibni affaana, assalaamu ‘alaika ya tsaalisal khulafaair raasyidiin. Assalaamu ‘alaika yaa mujahhiza jaysyil ‘usrati bin naqdi wal jaami’il qur’aani bainad daffataini jazaakallaahu ‘an ummati rasuulillaahi shallallaahu ‘alaihi wa sallama khairal jazaa’i. Allahummardha ‘anhu warfa’ darajatahu wakrim maqaamahu wa ajzil tsawaabahu.",
      "translasi": "Mudah-mudahan salam dan kesejahteraan atasmu wahai Utsman bin Affan, orang yang memiliki dua cahaya. Mudah-mudahan salam dan kesejahteraan atasmu, wahai khalifah ketiga. Mudah-mudahan salam dan kesejahteraan atasmu wahai orang yang mempersiapkan, membiayai bala tentara di masa perang yang sulit dengan harta dan peralatan, dan yang telah menghimpun Al-Quran dalam suatu lembaran tersusun. Mudah-mudahan Allah memberikan balasan dengan sebaik-baik balasan kepadamu dari umat Rasulullah Saw. Ya Allah, ridhailah dia, tinggikan derajatnya, muliakanlah kedudukannya dan berilah imbalan pahala kepadanya. Amin."
    },
    {
      "title": "doa ketika melintasi Maqam Ibrahim",
      "subtitle": "",
      "arab": ". رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا. وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا",
      "transliterasi": "Rabbi adkhilnii mudkhala shidqin wa akhrijnii mukhraja shidqin waj‘allii min ladunka sulthaanan nashiiraa wa qul jaa’al-khaqqu wazahaqal-baathilu innal-baathila kaana zahuuqaa.",
      "translasi": "Ya Tuhan-ku, masukkanlah aku secara masuk yang benar dan keluarkanlah (pula) aku secara keluar yang benar dan berikanlah kepadaku dari sisi Engkau kekuasaan yang menolong Dan katakanlah: “yang benar telah datang dan yang batil telah lenyap. Sesungguhnya yang batil itu adalah sesuatu yang pasti lenyap."
    },
    {
      "title": "doa salam syuhada",
      "subtitle": "",
      "arab": "السلام عليكم بما صبرتم فنعم عقبى الدار",
      "transliterasi": "Assalamu ‘alaikum bimaa shobartum fani’ma ‘uqbaddaar.",
      "translasi": "Keselamatan atas kalian semua, sebab kesabaran kalian. Maka alangkah baiknya tempat sesudahan itu."
    },
    {
      "title": "doa minum zamzam",
      "subtitle": "",
      "arab": "اللهم إني أسألك علماً نافعاً، ورزقاً واسعاً، وشفاءً من كل داء",
      "transliterasi": "Allahumma inni as-aluka ‘ilman naafi’a wa rizqon waasi’an wa syifa’an min kulli daa-in",
      "translasi": "Ya Allah aku memohon pada-Mu ilmu yang bermanfaat, rizqi yang luas, dan kesembuhan dari segala macam penyakit"
    }
  ]
}
